Repository: mate-desktop-legacy-archive/libmatecanvas
Catalog: po/*.po
Languages: pt

source: Antialiased
pt: Suavização

source: The antialiasing mode of the canvas.
pt: O modo de suavização da tela.

source: Text
pt: Texto

source: Text to render
pt: Texto a processar

source: Markup
pt: Formatação

source: Marked up text to render
pt: Texto formatado a processar

source: Font
pt: Tipo de letra

source: Font description as a string
pt: Descrição do tipo de letra como uma expressão

source: Font description
pt: Descrição do tipo de letra

source: Font description as a PangoFontDescription struct
pt: Descrição do tipo de letra como um estrutura PangoFontDescription

source: Font family
pt: Família do tipo de letra

source: Name of the font family, e.g. Sans, Helvetica, Times, Monospace
pt: Nome da família, por ex. Sans, Helvetica, Times, Monospace

source: Font style
pt: Estilo do tipo de letra

source: Font variant
pt: Variante do tipo de letra

source: Font weight
pt: Peso do tipo de letra

source: Font stretch
pt: Alargamento do tipo de letra

source: Font size
pt: Tamanho do tipo de letra

source: Font size (as a multiple of PANGO_SCALE, eg. 12*PANGO_SCALE for a 12pt font size)
pt: Tamanho do tipo de letra (múltiplo de PANGO_SCALE, por ex. 12*PANGO_SCALE para um tamanho de 12pt)

source: Font points
pt: Pontos do tipo de letra

source: Font size in points (eg. 12 for a 12pt font size)
pt: Tamanho do tipo de letra em pontos (por ex. 12 para um tamanho de 2pt)

source: Rise
pt: Elevação

source: Offset of text above the baseline (below the baseline if rise is negative)
pt: Deslocamento do texto acima da linha base (abaixo da linha base se o valor for negativo)

source: Strikethrough
pt: Rasurado

source: Whether to strike through the text
pt: Se o texto é ou não rasurado

source: Underline
pt: Sublinhar

source: Style of underline for this text
pt: Estilo do sublinhado para este texto

source: Scale
pt: Escala

source: Size of font, relative to default size
pt: Tamanho do tipo de letra relativamente ao tamanho pré-definido

source: Color
pt: Cor

source: Text color, as string
pt: Cor do texto como uma expressão

source: Text color, as a GdkColor
pt: Cor do texto como uma GdkColor

source: Text color, as an R/G/B/A combined integer
pt: Cor do texto como um inteiro combinado R/G/B/A

source: Text width
pt: Largura do texto

source: Width of the rendered text
pt: Largura do texto processado

source: Text height
pt: Altura do texto

source: Height of the rendered text
pt: Altura do texto processado

source: Font family set
pt: Conjunto da família do tipo de letra

source: Whether this tag affects the font family
pt: Se esta etiqueta afeta ou não a família do tipo de letra

source: Font style set
pt: Conjunto de estilo do tipo de letra

source: Whether this tag affects the font style
pt: Se esta etiqueta afeta ou não o estilo do tipo de letra

source: Font variant set
pt: Conjunto de variantes do tipo de letra

source: Whether this tag affects the font variant
pt: Se esta etiqueta afeta ou não a variante do tipo de letra

source: Font weight set
pt: Conjunto de peso da fonte

source: Whether this tag affects the font weight
pt: Se esta etiqueta afeta ou não o peso do tipo de letra

source: Font stretch set
pt: Conjunto de alargamento do tipo de letra

source: Whether this tag affects the font stretch
pt: Se esta etiqueta afeta ou não o alargamento do tipo de letra

source: Font size set
pt: Conjunto de tamanho do tipo de letra

source: Whether this tag affects the font size
pt: Se esta etiqueta afeta ou não o tamanho do tipo de letra

source: Rise set
pt: Conjunto de elevação

source: Whether this tag affects the rise
pt: Se esta etiqueta afeta ou não a elevação

source: Strikethrough set
pt: Conjunto de rasurado

source: Whether this tag affects strikethrough
pt: Se esta etiqueta afeta ou não o rasurado

source: Underline set
pt: Conjunto de sublinhado

source: Whether this tag affects underlining
pt: Se esta etiqueta afeta ou não o sublinhado

source: Scale set
pt: Conjunto de escala

source: Whether this tag affects font scaling
pt: Se esta etiqueta afeta ou não a escala

source: Text to display
pt: Texto a exibir

source: X position
pt: Posição X

source: Y position
pt: Posição Y

source: Width
pt: Largura

source: Width for text box
pt: Largura da caixa de texto

source: Height
pt: Altura

source: Height for text box
pt: Altura da caixa de texto

source: Editable
pt: Editável

source: Is this rich text item editable?
pt: Pode editar este tipo de texto especial?

source: Visible
pt: Visível

source: Is this rich text item visible?
pt: Este item de texto é visível?

source: Cursor Visible
pt: Cursor isível

source: Is the cursor visible in this rich text item?
pt: O cursor é visível neste item de texto?

source: Cursor Blink
pt: Intermitência do cursor

source: Does the cursor blink in this rich text item?
pt: O cursor pisca neste item de texto?

source: Grow Height
pt: Altura de crescimento

source: Should the text box height grow if the text does not fit?
pt: Deverá a caixa de texto ser ajustada ao tamanho do texto?

source: Wrap Mode
pt: Modo de translineação

source: Wrap mode for multiline text
pt: Modo de translineação para texto em linhas múltiplas

source: Justification
pt: Alinhamento

source: Justification mode
pt: Modo de alinhamento

source: Direction
pt: Orientação

source: Text direction
pt: Orientação do texto

source: Anchor
pt: Âncora

source: Anchor point for text
pt: Ponto de ancoragem para o texto

source: Pixels Above Lines
pt: Pixeis acima das linhas

source: Number of pixels to put above lines
pt: Número de pixeis a colocar sobre as linhas

source: Pixels Below Lines
pt: Pixeis abaixo das linhas

source: Number of pixels to put below lines
pt: Número de pixeis a colocar sob as linhas

source: Pixels Inside Wrap
pt: Pixeis dentro da translineação

source: Number of pixels to put inside the wrap
pt: Número de pixeis a colocar na translineação

source: Left Margin
pt: Margem esquerda

source: Number of pixels in the left margin
pt: Número de pixeis na margem esquerda

source: Right Margin
pt: Margem direita

source: Number of pixels in the right margin
pt: Número de pixeis na margem direita

source: Indentation
pt: Avanço

source: Number of pixels for indentation
pt: Número de pixeis para avanço
